# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.

# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.

# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.

# Ну і додатковим завданням є турбота про виведення.

# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.

# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек. Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)

# Доповнити провідними нулями можна за допомогою методу zfill(2)

# Приклад:

# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

seconds_input = input("Enter a number of seconds (0-8639999):\n")

if not seconds_input.isdigit():
    print("Invalid value")
    exit()

seconds_input = int(seconds_input)

if not 0 <= int(seconds_input) < 8640000:
    print("Value is out of range")
    exit()

seconds_minute = 60
seconds_hour = 60 * 60
seconds_day = 24 * 60 * 60

days, rest = divmod(seconds_input, seconds_day)
hours, rest = divmod(rest, seconds_hour)
minutes, seconds = divmod(rest, seconds_minute)

if days % 10 == 1 and days != 11:
    days = f"{days} день"
elif 2 <= days % 10 <= 4 and not (12 <= days <= 14):
    days = f"{days} дні"
else:
    days = f"{days} днів"

print(f"{days}, {hours:02}:{minutes:02}:{seconds:02}")
